<h3>Grouping and Aggregation</h3>

In [1]:
import pandas as pd

In [2]:
#Dataframe
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)
df

  Employee Region  Sales  Year
0    Alice  North    200  2023
1      Bob  South    150  2023
2    Alice  North    300  2024
3      Bob  South    400  2024
4  Charlie  North    100  2023
5    Alice  South    250  2024
6  Charlie  North    300  2024
7      Bob  North    350  2023

In [3]:
#Group the data by Employee and calculate the total sales for each employee
df.groupby("Employee").Sales.sum()

Employee
Alice      750
Bob        900
Charlie    400
Name: Sales, dtype: int64

In [4]:
#Group the data by Region and find the average sales per region
df.groupby("Region").Sales.mean()

Region
North    250.000000
South    266.666667
Name: Sales, dtype: float64

In [5]:
#Group the data by both Employee and Year to calculate the total sales for each combination
df.groupby(["Employee","Year"]).Sales.sum()

Employee  Year
Alice     2023    200
          2024    550
Bob       2023    500
          2024    400
Charlie   2023    100
          2024    300
Name: Sales, dtype: int64

<h3>Merging and Concatenation</h3>

In [6]:
#DataFrame
employee_details = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})

employee_details

  Employee  Age Department
0    Alice   25      Sales
1      Bob   30      Sales
2  Charlie   35  Marketing
3    David   40         HR

In [7]:
#Dataframe
sales_targets = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})
sales_targets

  Employee  Sales_Target
0    Alice          1000
1      Bob          1200
2  Charlie           800
3    David           500

In [8]:
#Merge the two datasets on the Employee column to combine all details
mergedDf=pd.merge(employee_details,sales_targets,on="Employee")
mergedDf

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

In [9]:
#Create a new column showing the difference between Sales_Target and total sales
mergedDf["Sales_Difference"]=mergedDf.Sales_Target-mergedDf.Employee.map(df.groupby("Employee").Sales.sum())
mergedDf

  Employee  Age Department  Sales_Target  Sales_Difference
0    Alice   25      Sales          1000             250.0
1      Bob   30      Sales          1200             300.0
2  Charlie   35  Marketing           800             400.0
3    David   40         HR           500               NaN

<h3> Working with Time-Series Data</h3>

In [10]:
#dataframe
stock_prices = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})
stock_prices

         Date  Price
0  2024-01-01    100
1  2024-01-02    102
2  2024-01-03    105
3  2024-01-04    107
4  2024-01-05    110

In [11]:

#Convert the Date column to a datetime object
stock_prices.Date=pd.to_datetime(stock_prices.Date)
stock_prices.Date.dtype

dtype('<M8[ns]')

In [12]:
#Resample the data to calculate the weekly average price
stock_prices.set_index("Date").resample("W").mean()

            Price
Date
2024-01-07  104.8

In [13]:
#Find the day with the highest stock price
stock_prices.Date.loc[stock_prices.Price.idxmax()]

Timestamp('2024-01-05 00:00:00')

<h3>Pivot Tables and Cross-Tabulations</h3>

In [14]:
#Dataframe from task 1
df

  Employee Region  Sales  Year
0    Alice  North    200  2023
1      Bob  South    150  2023
2    Alice  North    300  2024
3      Bob  South    400  2024
4  Charlie  North    100  2023
5    Alice  South    250  2024
6  Charlie  North    300  2024
7      Bob  North    350  2023

In [15]:
#Create a pivot table to find the total sales by Region and Year
pivot_table=df.pivot_table(index="Year",columns="Region",values="Sales",aggfunc="sum")
pivot_table

Region  North  South
Year
2023      650    150
2024      600    650

In [16]:
#Create a cross-tabulation showing the count of employees working in each Region for each Year
pd.crosstab(df.Region,df.Year,values=df.Employee,aggfunc="count")

Year    2023  2024
Region
North      3     2
South      1     2

<h3>Exporting Data</h3>

In [17]:
#Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv
mergedDf.to_csv("employee_sales.csv",index=False)

In [18]:
#Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx
pivot_table.to_excel("sales_summary.xlsx")